platform_admin/admin-sso/service/rbac_service.php

SELECT * FROM `admin_user_role` WHERE `uid`='1'
---
    protected function getRoleIdList($userid)
    {
        $AdminUserRole = AdminUserRole::find()->where(['uid' => $userid])->asArray()->all();