platform_admin/admin-sso/controllers/RbacController.php

    public function actionGetRoleIdList()
    {
        if(!Yii::$app->request->isPost) return false;
        $userid = Yii::$app->request->post('uid');

        $AdminUserRole = AdminUserRole::find()->where(['uid' => $userid])->asArray()->all();
---
SELECT * FROM `admin_user_role` WHERE `uid`='1'